# AI in Medicine
From vectors and matrices to artificial intelligence

## Data Science - Basics I
### Python Programming: *numpy* and *pandas*

Instructor: Dominique Sydow, AG Volkamer, Charité

## 1. Aims of this session

TBA

## 2. Learning goals

### Theory

* Data science - what is that?
* The *numpy* library
* The *pandas* library

### Practical

* Dataset
* Read data with *pandas* as DataFrame
* Look at data
* Look at individual DataFrame components
* Sort data
* Group data
* Subset data
* Drop columns
* Write data

## 3. References

* https://medium.com/dunder-data/how-to-learn-pandas-108905ab4955
* https://www.shanelynn.ie/select-pandas-dataframe-rows-and-columns-using-iloc-loc-and-ix/#iloc-selection
* https://medium.com/dunder-data/selecting-subsets-of-data-in-pandas-6fcd0170be9c

## 4. Theory

### Data Science

TBA

### The *numpy* library

#### Overview

* Role: TBA
* Website: https://numpy.org/
> NumPy is the fundamental package for scientific computing with Python. It contains among other things:
  * a powerful N-dimensional array object
  * sophisticated (broadcasting) functions
  * tools for integrating C/C++ and Fortran code
  * useful linear algebra, Fourier transform, and random number capabilities
* Documentation: https://numpy.org/devdocs/

#### Applications

TBA

### The *pandas* library

#### Overview

* Role: Data manipulation and analysis
* Website: https://pandas.pydata.org/
> *pandas* is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.
* Documentation: https://pandas.pydata.org/pandas-docs/stable/

#### Applications

Taken from: https://medium.com/dunder-data/how-to-learn-pandas-108905ab4955

*pandas* is capable of many tasks including:

* Reading/writing many different data formats
* Selecting subsets of data
* Calculating across rows and down columns
* Finding and filling missing data
* Applying operations to independent groups within the data
* Reshaping data into different forms
* Combing multiple datasets together
* Advanced time-series functionality
* Visualization through matplotlib and seaborn

#### DataFrame and Series

The *pandas* library has two primary containers of data, the DataFrame and the Series. You will spend nearly all your time working with both of the objects when you use pandas. The DataFrame is used more than the Series, so let’s take a look at an image of it first.

![DataFrame anatomy](https://cdn-images-1.medium.com/max/1600/1*ZSehcrMtBWN7_qCWq_HiSg.png)
Figure source: https://medium.com/dunder-data/selecting-subsets-of-data-in-pandas-6fcd0170be9c

## 5. Practical

In [2]:
import numpy as np
import pandas as pd

### 5.1. Dataset

Our dataset contains personal and health-related data on Alzheimer patients.

* Raw data: `alzheimers_disease.csv`
* Column name description: `dictionary.csv` - Use this file to check the meaning of column names.

### 5.2. Read data with *pandas* as DataFrame

The *pandas* library provides the function `read_csv` to read a comma-separated values (csv) file into a DataFrame.

In [4]:
data = pd.read_csv('./data/alzheimers_disease_rand.csv', delimiter=',')

### 5.3. Look at data

#### DataFrame dimensionality

Show the number of columns and rows (= dimensionality/shape) of the table in the form of `(number of rows, number of columns)`

In [5]:
data.shape

(14532, 110)

Set the number of rows displayed in this Jupyter notebook.

In [8]:
pd.set_option('display.max_rows', 20)

#### DataFrame head/tail

Have a look at the first few rows of the table.

In [9]:
data.head()  # data.head(10)

,RID,VISCODE,SITE,EXAMDATE,DX_bl,AGE,PTGENDER,PTEDUCAT,WORK,PTETHCAT,...,PTAU_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M,update_stamp,Unnamed: 109
0,128,bl,164,2005-09-08,CN,74.2,Male,16,technical writer and editor,Not Hisp/Latino,...,NaN,1.36665,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-04 04:19:56.0,NaN
1,129,bl,164,2005-09-12,AD,82.4,Male,18,Secretary,Not Hisp/Latino,...,22.83,1.08355,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-04 04:19:56.0,NaN
2,129,m06,164,2006-03-13,AD,81.4,Male,18,Elementary school teacher,Not Hisp/Latino,...,22.83,1.08355,NaN,NaN,0.498289,5.96721,6.0,6.0,2019-12-04 04:19:56.0,NaN
3,129,m12,164,2006-09-12,AD,81.3,Male,18,Communication,Not Hisp/Latino,...,22.83,1.08355,NaN,NaN,0.999316,11.96720,12.0,12.0,2019-12-04 04:19:56.0,NaN
4,129,m24,164,2007-09-12,AD,80.5,Male,18,Accounting,Not Hisp/Latino,...,22.83,1.08355,NaN,NaN,1.998630,23.93440,24.0,24.0,2019-12-04 04:19:56.0,NaN

Have a look at the last few rows of the table.

In [10]:
data.tail()  # data.tail(10)

,RID,VISCODE,SITE,EXAMDATE,DX_bl,AGE,PTGENDER,PTEDUCAT,WORK,PTETHCAT,...,PTAU_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M,update_stamp,Unnamed: 109
14527,6223,m24,252,2019-12-12,SMC,74.6,Male,18,RN,Not Hisp/Latino,...,NaN,NaN,NaN,1.004900,2.02053,24.1967,24.0,24.0,2019-12-14 04:20:30.0,NaN
14528,4832,m96,190,2019-12-16,EMCI,60.9,Male,14,painting contractor,Not Hisp/Latino,...,23.94,1.28876,NaN,0.946004,7.58385,90.8197,90.0,96.0,2019-12-17 04:20:22.0,NaN
14529,6262,m24,194,2019-12-03,CN,60.7,Male,12,Surgeon,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,1.96851,23.5738,24.0,24.0,2019-12-17 04:20:25.0,NaN
14530,6736,m12,159,2019-11-26,LMCI,60.7,Male,10,Insurance Broker,Not Hisp/Latino,...,NaN,1.19248,NaN,NaN,1.01574,12.1639,12.0,12.0,2019-12-17 04:20:26.0,NaN
14531,6960,bl,169,2019-12-11,NaN,81.3,Female,16,NaN,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,0.00000,0.0000,0.0,0.0,2019-12-17 04:20:26.0,NaN

#### DataFrame information

Get information about a DataFrame including the index dtype and column dtypes, non-null values and memory usage

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14532 entries, 0 to 14531
Columns: 110 entries, RID to Unnamed: 109
dtypes: float64(85), int64(4), object(21)
memory usage: 12.2+ MB

![bla](https://pbpython.com/images/pandas_dtypes.png)

#### DataFrame column names

Get a list of the columns names.

In [12]:
data.columns

Index(['RID', 'VISCODE', 'SITE', 'EXAMDATE', 'DX_bl', 'AGE', 'PTGENDER',
       'PTEDUCAT', 'WORK', 'PTETHCAT',
       ...
       'PTAU_bl', 'FDG_bl', 'PIB_bl', 'AV45_bl', 'Years_bl', 'Month_bl',
       'Month', 'M', 'update_stamp', 'Unnamed: 109'],
      dtype='object', length=110)

#### Descriptive statistics on DataFrame data

Use the describe method to see how the data is distributed (numerical features only!).

In [13]:
data.describe()

,RID,SITE,AGE,PTEDUCAT,FDG,PIB,AV45,CDRSB,ADAS11,ADAS13,...,EcogSPOrgan_bl,EcogSPDivatt_bl,EcogSPTotal_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M
count,14532.000000,14532.000000,14529.000000,14532.000000,3631.000000,223.000000,2669.000000,10431.000000,10298.000000,10203.000000,...,7003.000000,7179.000000,7332.000000,10204.000000,152.000000,6749.000000,14529.000000,14532.000000,14532.000000,14531.000000
mean,2689.323218,230.022296,73.522541,16.052092,1.205512,1.782337,1.189418,2.087528,11.494013,17.530563,...,1.594714,1.780169,1.639943,1.250349,1.581759,1.193165,2.422421,29.003632,28.925473,28.746198
std,2050.550766,120.005597,7.092087,2.796145,0.159062,0.423372,0.227379,2.852369,8.364001,11.371985,...,0.813544,0.876843,0.685036,0.224457,0.305296,0.219321,2.559634,30.652204,30.620796,30.468485
min,128.000000,155.000000,0.000000,4.000000,0.636743,1.095000,0.805364,0.000000,0.000000,0.000000,...,1.000000,1.000000,1.000000,0.693671,1.155000,0.805364,0.000000,0.000000,0.000000,0.000000
25%,806.000000,174.000000,69.000000,14.000000,1.108200,1.357500,1.007440,0.000000,6.000000,9.000000,...,1.000000,1.000000,1.108110,1.160830,1.360000,1.015360,0.495551,5.934430,6.000000,6.000000
50%,2171.000000,194.000000,73.500000,16.000000,1.217810,1.850000,1.106450,1.000000,9.330000,15.000000,...,1.166670,1.500000,1.378380,1.256040,1.490000,1.108140,1.524980,18.262300,18.000000,18.000000
75%,4615.000000,269.000000,78.500000,18.000000,1.310275,2.127500,1.353690,3.000000,15.000000,23.330000,...,2.000000,2.250000,1.964290,1.339960,1.835000,1.360150,3.542780,42.426200,42.000000,42.000000
max,6963.000000,1094.000000,93.100000,20.000000,1.751210,2.927500,2.669210,18.000000,70.000000,85.000000,...,4.000000,4.000000,3.948720,18.620000,2.282500,2.025560,14.086200,168.689000,168.000000,168.000000

#### Exercise

1. What is the number of rows of this DataFrame? Why are some counts lower than that value?
2. What is the mean patients' age?
3. What is the minimum and maximum number of years that a patient (or multiple patients) spent on his/her/their education?

In [14]:
# Solution
print(f'1. The number of rows is {data.shape[0]} but some rows contain empty values, thus the count is decreased.')
print(f'2. The patients\' mean age is {data.describe().loc["mean", "AGE"]}.')
print(f'3. The minimum and maximum number of years patients spend on education are {data.describe().loc["min", "PTEDUCAT"]} and {data.describe().loc["max", "PTEDUCAT"]}.')

1. The number of rows is 14532 but some rows contain empty values, thus the count is decreased.
2. The patients' mean age is 73.52254112464726.
3. The minimum and maximum number of years patients spend on education are 4.0 and 20.0.

### 5.4. Look at individual DataFrame components

Taken from: https://medium.com/dunder-data/selecting-subsets-of-data-in-pandas-6fcd0170be9c

*pandas* DataFrame are composed of three components. The **index**, **columns** and data (**values**). 
Let's extract each of these components into their own variables and inspect them:

In [15]:
index = data.index
index

RangeIndex(start=0, stop=14532, step=1)

In [16]:
columns = data.columns
columns

Index(['RID', 'VISCODE', 'SITE', 'EXAMDATE', 'DX_bl', 'AGE', 'PTGENDER',
       'PTEDUCAT', 'WORK', 'PTETHCAT',
       ...
       'PTAU_bl', 'FDG_bl', 'PIB_bl', 'AV45_bl', 'Years_bl', 'Month_bl',
       'Month', 'M', 'update_stamp', 'Unnamed: 109'],
      dtype='object', length=110)

In [17]:
values = data.values
values

array([[128, 'bl', 164, ..., 0.0, '2019-12-04 04:19:56.0', nan],
       [129, 'bl', 164, ..., 0.0, '2019-12-04 04:19:56.0', nan],
       [129, 'm06', 164, ..., 6.0, '2019-12-04 04:19:56.0', nan],
       ...,
       [6262, 'm24', 194, ..., 24.0, '2019-12-17 04:20:25.0', nan],
       [6736, 'm12', 159, ..., 12.0, '2019-12-17 04:20:26.0', nan],
       [6960, 'bl', 169, ..., 0.0, '2019-12-17 04:20:26.0', nan]],
      dtype=object)

In [18]:
type(index)

pandas.core.indexes.range.RangeIndex

In [19]:
type(columns)

pandas.core.indexes.base.Index

In [20]:
type(values)

numpy.ndarray

Interestingly, both the `index` and the `columns` are the same type. They are both a *pandas* `Index` object. This object is quite powerful in itself, but for now you can just think of it as a sequence of labels for either the rows or the columns.

The `values`'s type is a *NumPy* `ndarray`, which stands for n-dimensional array, and is the primary container of data in the *NumPy* library. *pandas* is built directly on top of *NumPy* and it's this array that is responsible for the bulk of the workload.

### 5.5. Sort data

We can sort data by the values along one or multiple rows or columns using the `sort_values` function.

For simplicity, we will only sort our data by one column, e.g. by the patients' examination date.

In [21]:
data.sort_values(by='EXAMDATE', ascending=False).head()  # Sorted by latest examination date

,RID,VISCODE,SITE,EXAMDATE,DX_bl,AGE,PTGENDER,PTEDUCAT,WORK,PTETHCAT,...,PTAU_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M,update_stamp,Unnamed: 109
14528,4832,m96,190,2019-12-16,EMCI,60.9,Male,14,painting contractor,Not Hisp/Latino,...,23.94,1.28876,NaN,0.946004,7.58385,90.8197,90.0,96.0,2019-12-17 04:20:22.0,NaN
14522,5261,m84,182,2019-12-12,EMCI,76.5,Male,16,engineer,Not Hisp/Latino,...,16.13,1.26256,NaN,1.186100,6.57632,78.7541,78.0,84.0,2019-12-17 04:20:24.0,NaN
14527,6223,m24,252,2019-12-12,SMC,74.6,Male,18,RN,Not Hisp/Latino,...,NaN,NaN,NaN,1.004900,2.02053,24.1967,24.0,24.0,2019-12-14 04:20:30.0,NaN
14521,4351,m96,155,2019-12-12,CN,70.0,Male,20,secretary,Not Hisp/Latino,...,38.07,1.43957,NaN,1.496110,8.18891,98.0656,96.0,96.0,2019-12-13 04:20:22.0,NaN
14531,6960,bl,169,2019-12-11,NaN,81.3,Female,16,NaN,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,0.00000,0.0000,0.0,0.0,2019-12-17 04:20:26.0,NaN

In [22]:
data.sort_values(by='EXAMDATE', ascending=True).head()  # Sorted by earliest examination date

,RID,VISCODE,SITE,EXAMDATE,DX_bl,AGE,PTGENDER,PTEDUCAT,WORK,PTETHCAT,...,PTAU_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M,update_stamp,Unnamed: 109
10,131,bl,164,2005-09-07,CN,75.7,Male,16,NaN,Not Hisp/Latino,...,33.43,1.29343,NaN,NaN,0.0,0.0,0.0,0.0,2019-12-04 04:19:56.0,NaN
0,128,bl,164,2005-09-08,CN,74.2,Male,16,technical writer and editor,Not Hisp/Latino,...,NaN,1.36665,NaN,NaN,0.0,0.0,0.0,0.0,2019-12-04 04:19:56.0,NaN
1,129,bl,164,2005-09-12,AD,82.4,Male,18,Secretary,Not Hisp/Latino,...,22.83,1.08355,NaN,NaN,0.0,0.0,0.0,0.0,2019-12-04 04:19:56.0,NaN
11507,134,bl,164,2005-09-19,CN,85.8,Female,18,pharmaceutical salesperson,Not Hisp/Latino,...,37.51,1.27450,NaN,NaN,0.0,0.0,0.0,0.0,2019-12-04 04:19:56.0,NaN
20,133,bl,175,2005-10-06,AD,75.3,Male,10,chartered accountant,Hisp/Latino,...,NaN,NaN,NaN,NaN,0.0,0.0,0.0,0.0,2019-12-04 04:19:56.0,NaN

#### Exercise

Sort data by youngest patients and show only top 3 patients.

In [23]:
# Solution
data.sort_values(by='AGE', ascending=True).head(3)

,RID,VISCODE,SITE,EXAMDATE,DX_bl,AGE,PTGENDER,PTEDUCAT,WORK,PTETHCAT,...,PTAU_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M,update_stamp,Unnamed: 109
14387,6877,bl,188,2019-07-11,SMC,0.0,Female,16,Engineer,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,0.000000,0.0000,0.0,0.0,2019-12-04 04:20:19.0,NaN
2054,1120,bl,290,2006-12-06,LMCI,52.0,Female,18,farming/waste management,Not Hisp/Latino,...,51.42,1.13028,NaN,NaN,0.000000,0.0000,0.0,0.0,2019-12-04 04:20:04.0,NaN
2056,1120,m12,290,2007-12-06,LMCI,52.9,Female,18,Social worker,Not Hisp/Latino,...,51.42,1.13028,NaN,NaN,0.999316,11.9672,12.0,12.0,2019-12-04 04:20:04.0,NaN

### 5.6. Group data

From https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html

> By “group by” we are referring to a process involving one or more of the following steps:
> * **Splitting** the data into groups based on some criteria.
> * **Applying** a function to each group independently.
> * **Combining** the results into a data structure.

**Splitting**: Split data into groups based on criteria, e.g. the civil status.

In [24]:
data.groupby('PTMARRY')

**Applying and combining**: Apply function to each group, e.g. get the number of entries in each group (function `size`).

In [25]:
data.groupby('PTMARRY').size()

PTMARRY
Divorced          1209
Married          11116
Never married      454
Unknown             53
White                3
Widowed           1697
dtype: int64

The result is combined into a data structure, i.e. `Series`.

In [26]:
type(data.groupby('PTMARRY').size())

pandas.core.series.Series

We can also apply other functions to our grouped data.

Return the first element in each group (`first`):

In [27]:
data.groupby('PTMARRY').first()

,RID,VISCODE,SITE,EXAMDATE,DX_bl,AGE,PTGENDER,PTEDUCAT,WORK,PTETHCAT,...,PTAU_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M,update_stamp,Unnamed: 109
PTMARRY,,,,,,,,,,,,,,,,,,,,,
Divorced,140,bl,175,2005-11-04,CN,78.3,Female,12,legal secretary,Hisp/Latino,...,16.68,1.25096,1.67250,1.049550,0.00000,0.000000,0.0000,0.0,2019-12-04 04:19:56.0,NaN
Married,128,bl,164,2005-09-08,CN,74.2,Male,16,technical writer and editor,Not Hisp/Latino,...,22.83,1.36665,1.49000,1.326790,0.00000,0.000000,0.0000,0.0,2019-12-04 04:19:56.0,NaN
Never married,5406,m24,253,2015-09-29,SMC,66.4,Male,16,Registered Nurse,Not Hisp/Latino,...,10.08,1.25096,NaN,0.983143,2.03149,24.327900,24.0000,24.0,2019-12-04 04:20:18.0,NaN
Unknown,1393,bl,247,2007-03-16,CN,73.4,Male,16,Educator,Not Hisp/Latino,...,10.40,1.25804,NaN,1.004690,0.00000,0.000000,0.0000,0.0,2019-12-04 04:20:06.0,NaN
White,982,m12,164,2007-09-25,LMCI,60.7,Male,13,Military,Air Force,...,213.70,18.62000,1.18734,1.567500,NaN,0.988364,11.8361,12.0,12,2019-12-04 04:20:03.0
Widowed,149,bl,164,2005-11-08,CN,73.4,Male,14,Secretary,Not Hisp/Latino,...,16.74,1.36097,1.90250,1.734130,0.00000,0.000000,0.0000,0.0,2019-12-04 04:19:56.0,NaN

Return the mean of each numerical column for each group (`mean`):

In [28]:
data.groupby('PTMARRY').mean()

,RID,SITE,AGE,PTEDUCAT,FDG,PIB,AV45,CDRSB,ADAS11,ADAS13,...,EcogSPOrgan_bl,EcogSPDivatt_bl,EcogSPTotal_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M
PTMARRY,,,,,,,,,,,,,,,,,,,,,
Divorced,3291.654260,223.070306,70.829032,16.191067,1.244450,1.640000,1.160615,1.381640,9.692649,14.474584,...,1.343620,1.572745,1.420171,1.280540,1.742308,1.150095,2.171089,25.999675,25.957816,25.786600
Married,2641.822688,230.516823,73.121623,16.198813,1.196356,1.796808,1.190302,2.215350,11.861407,18.073441,...,1.640734,1.822297,1.687627,1.241390,1.543079,1.196235,2.443094,29.257051,29.174433,29.014575
Never married,3079.861233,247.359031,73.142952,16.288546,1.255222,1.574167,1.129356,1.050459,8.969072,13.779149,...,1.379476,1.584651,1.416639,1.277663,NaN,1.136882,2.167781,25.960063,25.803965,25.638767
Unknown,2941.018868,250.000000,68.700000,15.509434,1.306954,NaN,1.018476,0.959459,7.333250,11.316154,...,1.499999,1.885870,1.618948,1.308734,NaN,1.020542,1.853266,22.193632,22.018868,21.396226
White,3135.000000,208.666667,69.366667,16.333333,1.000000,1.251200,1.435000,NaN,1.666667,13.666667,...,1.200000,2.000000,2.000000,18.620000,1.187340,1.567500,NaN,0.667121,7.989067,8.000000
Widowed,2458.219210,226.511491,78.326458,14.945197,1.223788,1.774485,1.235103,2.063839,11.259461,17.450841,...,1.604590,1.753841,1.610115,1.260279,1.664583,1.246703,2.551963,30.560797,30.496759,30.194461

#### Exercise

Group data by the patients' occupation. If you wanted to statistically analyse the patient's occupation, which problems in the data would you need to solve first?

In [29]:
# Solution
data.groupby('WORK').size()

WORK
20 YEAR ARMY 13 YEARS TEACHER                                          3
20 YEARS CARRER NAVY LT.CDR                                            4
20 Years Officer in Navy                                               3
28 years in elementary school, 6 years in high school as a teacher     3
3M Management                                                          3
                                                                      ..
works is plant nursery                                                 4
writer                                                                 9
writer and editor                                                     12
writer/editor                                                         13
writer/reporter                                                        3
Length: 2364, dtype: int64

### 5.7. Subset data

We can select data from a DataFrame by label, by index or a combination of both using `.loc`, `.iloc` and `[ ]`.

#### Select data (columns/rows) by position: `iloc`

The `iloc` indexer in `pandas` is used for indexing / selection by position.

The `iloc` indexer syntax is `data.iloc[<row selection>, <column selection>]`, used to select rows and columns by number, in the order that they appear in the DataFrame.

In [30]:
data.iloc[4]  # Get 5th row of DataFrame

RID                               129
VISCODE                           m24
SITE                              164
EXAMDATE                   2007-09-12
DX_bl                              AD
                        ...
Month_bl                      23.9344
Month                              24
M                                  24
update_stamp    2019-12-04 04:19:56.0
Unnamed: 109                      NaN
Name: 4, Length: 110, dtype: object

In [31]:
data.iloc[:, 6]  # Get 7th column of DataFrame

0          Male
1          Male
2          Male
3          Male
4          Male
          ...
14527      Male
14528      Male
14529      Male
14530      Male
14531    Female
Name: PTGENDER, Length: 14532, dtype: object

In [32]:
data.iloc[0, 6]  # Get element in 1th row of the 7th column

'Male'

In [33]:
data.iloc[0:5, 5:8]  # Get multiple rows/columns

    AGE PTGENDER  PTEDUCAT
0  74.2     Male        16
1  82.4     Male        18
2  81.4     Male        18
3  81.3     Male        18
4  80.5     Male        18

#### Select data (columns/rows) by label: `loc`

The `loc` indexer in `pandas` is used for indexing / selection by label (column and/or row label).

The `loc` indexer is used with the same syntax as `iloc`: `data.loc[<row selection>, <column selection>]`.

In [34]:
data.loc[1]

RID                               129
VISCODE                            bl
SITE                              164
EXAMDATE                   2005-09-12
DX_bl                              AD
                        ...
Month_bl                            0
Month                               0
M                                   0
update_stamp    2019-12-04 04:19:56.0
Unnamed: 109                      NaN
Name: 1, Length: 110, dtype: object

In [35]:
data.loc[2:5, 'WORK']

2    Elementary school teacher
3                Communication
4                   Accounting
5                          NaN
Name: WORK, dtype: object

#### Select data (columns) by `[ ]`

In [36]:
data['AGE'].head()  # Returns Series

0    74.2
1    82.4
2    81.4
3    81.3
4    80.5
Name: AGE, dtype: float64

In [37]:
data[['AGE']].head()  # Returns DataFrame

    AGE
0  74.2
1  82.4
2  81.4
3  81.3
4  80.5

In [38]:
data[['PTGENDER', 'AGE']].head()

  PTGENDER   AGE
0     Male  74.2
1     Male  82.4
2     Male  81.4
3     Male  81.3
4     Male  80.5

It is possible to check for the elements of a column whether they fulfill a certain condition (`True`) or not (`False`), returning a `Series` of boolean values (`True`/`False`).

In [39]:
data['PTGENDER']  == 'Female'  # Per row: Is the patient female?

0        False
1        False
2        False
3        False
4        False
         ...
14527    False
14528    False
14529    False
14530    False
14531     True
Name: PTGENDER, Length: 14532, dtype: bool

This list of boolean values can be used to select only those rows of the DataFrame that fullfill a condition.

In [40]:
data[data['PTGENDER']  == 'Female']

,RID,VISCODE,SITE,EXAMDATE,DX_bl,AGE,PTGENDER,PTEDUCAT,WORK,PTETHCAT,...,PTAU_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M,update_stamp,Unnamed: 109
15,132,bl,253,2005-11-29,LMCI,80.0,Female,13,Transportation Operation Sales,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-04 04:19:56.0,NaN
16,132,m06,253,2006-06-01,LMCI,79.4,Female,13,clerical worker,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,0.503765,6.03279,6.0,6.0,2019-12-04 04:19:56.0,NaN
17,132,m12,253,2006-11-20,LMCI,80.3,Female,13,Special Education Teacher,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,0.974675,11.67210,12.0,12.0,2019-12-04 04:19:56.0,NaN
18,132,m18,253,2007-05-15,LMCI,80.0,Female,13,RN,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,1.456540,17.44260,18.0,18.0,2019-12-04 04:19:56.0,NaN
19,132,m36,253,2008-12-08,LMCI,81.2,Female,13,Book keeper,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,3.025330,36.22950,36.0,36.0,2019-12-04 04:19:56.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14518,6937,bl,454,2019-12-03,LMCI,75.2,Female,18,medical doctor,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-13 04:20:29.0,NaN
14519,6959,bl,156,2019-12-11,NaN,87.7,Female,16,registered Nurse,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-13 04:20:30.0,NaN
14524,4326,m96,194,2019-12-10,CN,69.3,Female,18,US ARMY,Not Hisp/Latino,...,13.05,1.45546,NaN,1.06161,8.147840,97.57380,96.0,96.0,2019-12-14 04:20:23.0,NaN
14525,4477,m96,290,2019-11-13,EMCI,67.2,Female,16,Housewife,Not Hisp/Latino,...,24.86,1.43161,NaN,1.35971,7.917860,94.81970,96.0,96.0,2019-12-14 04:20:25.0,NaN
14531,6960,bl,169,2019-12-11,NaN,81.3,Female,16,NaN,Not Hisp/Latino,...,NaN,NaN,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-17 04:20:26.0,NaN

#### Exercise

Get all patients' civil/marital status (column name *PTMARRY*).

In [41]:
# Solution
data['PTMARRY']

0              Married
1              Married
2              Married
3              Married
4              Married
             ...
14527          Married
14528          Married
14529    Never married
14530          Married
14531         Divorced
Name: PTMARRY, Length: 14532, dtype: object

Get the value in the 5th row of the 4th column.

In [42]:
# Solution
data.iloc[4, 3]

'2007-09-12'

Get the 5th patient's occupation (column name *WORK*).

In [43]:
# Solution
data.loc[4, 'WORK']

'Accounting'

Select only divorced patients. How many are they?

In [44]:
# Solution
data[data['PTMARRY'] == 'Divorced'].shape[0]

1209

### 5.8. Drop columns

We can use the `drop` function to remove rows (`axis=0`, default) or columns (`axis=1`) by their labels.

In [45]:
data.head(3)

,RID,VISCODE,SITE,EXAMDATE,DX_bl,AGE,PTGENDER,PTEDUCAT,WORK,PTETHCAT,...,PTAU_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M,update_stamp,Unnamed: 109
0,128,bl,164,2005-09-08,CN,74.2,Male,16,technical writer and editor,Not Hisp/Latino,...,NaN,1.36665,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-04 04:19:56.0,NaN
1,129,bl,164,2005-09-12,AD,82.4,Male,18,Secretary,Not Hisp/Latino,...,22.83,1.08355,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-04 04:19:56.0,NaN
2,129,m06,164,2006-03-13,AD,81.4,Male,18,Elementary school teacher,Not Hisp/Latino,...,22.83,1.08355,NaN,NaN,0.498289,5.96721,6.0,6.0,2019-12-04 04:19:56.0,NaN

In [46]:
data.drop(0, axis=0).head(3)  # Remove first row

,RID,VISCODE,SITE,EXAMDATE,DX_bl,AGE,PTGENDER,PTEDUCAT,WORK,PTETHCAT,...,PTAU_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M,update_stamp,Unnamed: 109
1,129,bl,164,2005-09-12,AD,82.4,Male,18,Secretary,Not Hisp/Latino,...,22.83,1.08355,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-04 04:19:56.0,NaN
2,129,m06,164,2006-03-13,AD,81.4,Male,18,Elementary school teacher,Not Hisp/Latino,...,22.83,1.08355,NaN,NaN,0.498289,5.96721,6.0,6.0,2019-12-04 04:19:56.0,NaN
3,129,m12,164,2006-09-12,AD,81.3,Male,18,Communication,Not Hisp/Latino,...,22.83,1.08355,NaN,NaN,0.999316,11.96720,12.0,12.0,2019-12-04 04:19:56.0,NaN

In [47]:
data.drop('AGE', axis=1).head(3)  # Remove AGE column

,RID,VISCODE,SITE,EXAMDATE,DX_bl,PTGENDER,PTEDUCAT,WORK,PTETHCAT,PTRACCAT,...,PTAU_bl,FDG_bl,PIB_bl,AV45_bl,Years_bl,Month_bl,Month,M,update_stamp,Unnamed: 109
0,128,bl,164,2005-09-08,CN,Male,16,technical writer and editor,Not Hisp/Latino,White,...,NaN,1.36665,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-04 04:19:56.0,NaN
1,129,bl,164,2005-09-12,AD,Male,18,Secretary,Not Hisp/Latino,White,...,22.83,1.08355,NaN,NaN,0.000000,0.00000,0.0,0.0,2019-12-04 04:19:56.0,NaN
2,129,m06,164,2006-03-13,AD,Male,18,Elementary school teacher,Not Hisp/Latino,White,...,22.83,1.08355,NaN,NaN,0.498289,5.96721,6.0,6.0,2019-12-04 04:19:56.0,NaN

#### Exercise

We want to remove all column with column names containing the patterns **\*_bl** and **Ecog\***.

1. Look again at column names.

In [48]:
list(data.columns)

['RID',
 'VISCODE',
 'SITE',
 'EXAMDATE',
 'DX_bl',
 'AGE',
 'PTGENDER',
 'PTEDUCAT',
 'WORK',
 'PTETHCAT',
 'PTRACCAT',
 'PTMARRY',
 'APOE4',
 'FDG',
 'PIB',
 'AV45',
 'ABETA',
 'TAU',
 'PTAU',
 'CDRSB',
 'ADAS11',
 'ADAS13',
 'ADASQ4',
 'MMSE',
 'RAVLT_immediate',
 'RAVLT_learning',
 'RAVLT_forgetting',
 'RAVLT_perc_forgetting',
 'LDELTOTAL',
 'DIGITSCOR',
 'TRABSCOR',
 'FAQ',
 'MOCA',
 'EcogPtMem',
 'EcogPtLang',
 'EcogPtVisspat',
 'EcogPtPlan',
 'EcogPtOrgan',
 'EcogPtDivatt',
 'EcogPtTotal',
 'EcogSPMem',
 'EcogSPLang',
 'EcogSPVisspat',
 'EcogSPPlan',
 'EcogSPOrgan',
 'EcogSPDivatt',
 'EcogSPTotal',
 'FLDSTRENG',
 'IMAGEUID',
 'Ventricles',
 'Hippocampus',
 'WholeBrain',
 'Entorhinal',
 'Fusiform',
 'MidTemp',
 'ICV',
 'DX',
 'mPACCdigit',
 'mPACCtrailsB',
 'EXAMDATE_bl',
 'CDRSB_bl',
 'ADAS11_bl',
 'ADAS13_bl',
 'ADASQ4_bl',
 'MMSE_bl',
 'RAVLT_immediate_bl',
 'RAVLT_learning_bl',
 'RAVLT_forgetting_bl',
 'RAVLT_perc_forgetting_bl',
 'LDELTOTAL_BL',
 'DIGITSCOR_bl',
 'TRABSCOR_bl',
 'FAQ_bl',
 'mPACCdigit_bl',
 'mPACCtrailsB_bl',
 'FLDSTRENG_bl',
 'Ventricles_bl',
 'Hippocampus_bl',
 'WholeBrain_bl',
 'Entorhinal_bl',
 'Fusiform_bl',
 'MidTemp_bl',
 'ICV_bl',
 'MOCA_bl',
 'EcogPtMem_bl',
 'EcogPtLang_bl',
 'EcogPtVisspat_bl',
 'EcogPtPlan_bl',
 'EcogPtOrgan_bl',
 'EcogPtDivatt_bl',
 'EcogPtTotal_bl',
 'EcogSPMem_bl',
 'EcogSPLang_bl',
 'EcogSPVisspat_bl',
 'EcogSPPlan_bl',
 'EcogSPOrgan_bl',
 'EcogSPDivatt_bl',
 'EcogSPTotal_bl',
 'ABETA_bl',
 'TAU_bl',
 'PTAU_bl',
 'FDG_bl',
 'PIB_bl',
 'AV45_bl',
 'Years_bl',
 'Month_bl',
 'Month',
 'M',
 'update_stamp',
 'Unnamed: 109']

2. Get all column names with the patterns **\*_bl** and **Ecog\*** and save them in a list `column_names_unwanted`.

This step has nothing to do with the *pandas* world and is probably new to you. Thus, you find in the following a minimal example which you can apply to our DataFrame.

In [49]:
# Minimal example; unwanted patterns 'color_*' and 'examination_*'

column_names = ['age', 'gender', 'color_hair', 'color_eyes', 'examination_1', 'examination_2']
column_names_unwanted = []

for column_name in column_names:
    
    if ('color_' in column_name) or ('examination_' in column_name):
        column_names_unwanted.append(column_name)
        
column_names_unwanted

['color_hair', 'color_eyes', 'examination_1', 'examination_2']

Now apply this minimal example to our DataFrame.

In [50]:
# Solution

column_names_unwanted = []

for column_name in data.columns:
    if ('_bl' in column_name) or ('Ecog' in column_name):
        column_names_unwanted.append(column_name)

column_names_unwanted

['DX_bl',
 'EcogPtMem',
 'EcogPtLang',
 'EcogPtVisspat',
 'EcogPtPlan',
 'EcogPtOrgan',
 'EcogPtDivatt',
 'EcogPtTotal',
 'EcogSPMem',
 'EcogSPLang',
 'EcogSPVisspat',
 'EcogSPPlan',
 'EcogSPOrgan',
 'EcogSPDivatt',
 'EcogSPTotal',
 'EXAMDATE_bl',
 'CDRSB_bl',
 'ADAS11_bl',
 'ADAS13_bl',
 'ADASQ4_bl',
 'MMSE_bl',
 'RAVLT_immediate_bl',
 'RAVLT_learning_bl',
 'RAVLT_forgetting_bl',
 'RAVLT_perc_forgetting_bl',
 'DIGITSCOR_bl',
 'TRABSCOR_bl',
 'FAQ_bl',
 'mPACCdigit_bl',
 'mPACCtrailsB_bl',
 'FLDSTRENG_bl',
 'Ventricles_bl',
 'Hippocampus_bl',
 'WholeBrain_bl',
 'Entorhinal_bl',
 'Fusiform_bl',
 'MidTemp_bl',
 'ICV_bl',
 'MOCA_bl',
 'EcogPtMem_bl',
 'EcogPtLang_bl',
 'EcogPtVisspat_bl',
 'EcogPtPlan_bl',
 'EcogPtOrgan_bl',
 'EcogPtDivatt_bl',
 'EcogPtTotal_bl',
 'EcogSPMem_bl',
 'EcogSPLang_bl',
 'EcogSPVisspat_bl',
 'EcogSPPlan_bl',
 'EcogSPOrgan_bl',
 'EcogSPDivatt_bl',
 'EcogSPTotal_bl',
 'ABETA_bl',
 'TAU_bl',
 'PTAU_bl',
 'FDG_bl',
 'PIB_bl',
 'AV45_bl',
 'Years_bl',
 'Month_bl']

3. Drop all unwanted column names in `column_names_unwanted`.

In [51]:
# Solution

data.drop(column_names_unwanted, axis=1).head()

,RID,VISCODE,SITE,EXAMDATE,AGE,PTGENDER,PTEDUCAT,WORK,PTETHCAT,PTRACCAT,...,MidTemp,ICV,DX,mPACCdigit,mPACCtrailsB,LDELTOTAL_BL,Month,M,update_stamp,Unnamed: 109
0,128,bl,164,2005-09-08,74.2,Male,16,technical writer and editor,Not Hisp/Latino,White,...,27930.0,1984658.0,CN,-4.41005,-4.23545,10.0,0.0,0.0,2019-12-04 04:19:56.0,NaN
1,129,bl,164,2005-09-12,82.4,Male,18,Secretary,Not Hisp/Latino,White,...,18425.0,1920689.0,Dementia,-16.6244,-16.23320,2.0,0.0,0.0,2019-12-04 04:19:56.0,NaN
2,129,m06,164,2006-03-13,81.4,Male,18,Elementary school teacher,Not Hisp/Latino,White,...,16975.0,1906429.0,Dementia,-15.092,-13.49320,2.0,6.0,6.0,2019-12-04 04:19:56.0,NaN
3,129,m12,164,2006-09-12,81.3,Male,18,Communication,Not Hisp/Latino,White,...,17333.0,1903819.0,Dementia,-21.4587,-20.29090,2.0,12.0,12.0,2019-12-04 04:19:56.0,NaN
4,129,m24,164,2007-09-12,80.5,Male,18,Accounting,Not Hisp/Latino,White,...,16401.0,1903419.0,Dementia,-20.1324,-20.34260,2.0,24.0,24.0,2019-12-04 04:19:56.0,NaN

### Write data

Save our reduced DataFrame to a `csv` file next to the original `csv` file.

In [52]:
data.drop(column_names_unwanted, axis=1).to_csv('data/alzheimers_disease_reduced.csv', index=False)

## 6. Summary

TBA